{"type":"data","nodes":[null,{"type":"data","data":[{"post":1},{"slug":2,"title":3,"date":4,"excerpt":5,"tags":6,"html":9,"css":10,"head":11,"readingTime":13,"relatedPosts":14},"software-craftmanship","What Software Craftsmanship is about?","2022-12-31T00:00:00.000Z","Why is there a software craftsmanship movement? What motivated it? What drives it now?",[7,8],"Clean Code","Software Craftmanship","\u003Cp\u003EOne thing; and one thing only.\u003C\u002Fp\u003E\n\u003Cblockquote\u003E\u003Cp\u003EWe are tired of writing crap. That’s it. The fat lady sang. Good nite Gracy. Over and out.\u003C\u002Fp\u003E\u003C\u002Fblockquote\u003E\n\u003Cp\u003EWe’re tired of writing crap. We are tired of embarrassing ourselves and our employers by delivering lousy software.\nWe have had enough of telling our customers to reboot at midnight. We don’t want bug lists that are a thousand pages long.\nWe don’t want code that grows more tangled and corrupt with every passing day. We’re tired of doing a bad job.\nWe want to start doing a good job.\u003C\u002Fp\u003E\n\u003Cp\u003EThat’s … what … this … is … about. Nothing else.\u003C\u002Fp\u003E\n\u003Ch3 id=\"what-we-are-not-doing\"\u003EWhat we are not doing:\u003Ca aria-hidden=\"true\" tabindex=\"-1\" href=\"#what-we-are-not-doing\"\u003E\u003Cspan class=\"heading-link\"\u003E#\u003C\u002Fspan\u003E\u003C\u002Fa\u003E\u003C\u002Fh3\u003E\n\u003Cul\u003E\u003Cli\u003EWe are not putting code at the center of everything.\u003C\u002Fli\u003E\n\u003Cli\u003EWe are not turning inward and ignoring the business and the customer.\u003C\u002Fli\u003E\n\u003Cli\u003EWe are not inspecting our navels.\u003C\u002Fli\u003E\n\u003Cli\u003EWe are not offering cheap certifications.\u003C\u002Fli\u003E\n\u003Cli\u003EWe are not forgetting that our job is to delight our customers.\u003C\u002Fli\u003E\u003C\u002Ful\u003E\n\u003Ch3 id=\"what-we-will-not-do-anymore\"\u003EWhat we will not do anymore:\u003Ca aria-hidden=\"true\" tabindex=\"-1\" href=\"#what-we-will-not-do-anymore\"\u003E\u003Cspan class=\"heading-link\"\u003E#\u003C\u002Fspan\u003E\u003C\u002Fa\u003E\u003C\u002Fh3\u003E\n\u003Cul\u003E\u003Cli\u003EWe will not make messes in order to meet a schedule.\u003C\u002Fli\u003E\n\u003Cli\u003EWe will not accept the stupid old lie about cleaning things up later.\u003C\u002Fli\u003E\n\u003Cli\u003EWe will not believe the claim that quick means dirty.\u003C\u002Fli\u003E\n\u003Cli\u003EWe will not accept the option to do it wrong.\u003C\u002Fli\u003E\n\u003Cli\u003EWe will not allow anyone to force us to behave unprofessionally.\u003C\u002Fli\u003E\u003C\u002Ful\u003E\n\u003Ch3 id=\"what-we-will-do-from-now-on\"\u003EWhat we will do from now on:\u003Ca aria-hidden=\"true\" tabindex=\"-1\" href=\"#what-we-will-do-from-now-on\"\u003E\u003Cspan class=\"heading-link\"\u003E#\u003C\u002Fspan\u003E\u003C\u002Fa\u003E\u003C\u002Fh3\u003E\n\u003Cul\u003E\u003Cli\u003EWe will meet our schedules by knowing that the only way to go fast is to go well.\u003C\u002Fli\u003E\n\u003Cli\u003EWe will delight our customers by writing the best code we can.\u003C\u002Fli\u003E\n\u003Cli\u003EWe will honor our employers by creating the best designs we can.\u003C\u002Fli\u003E\n\u003Cli\u003EWe will honor our team by testing everything that can be tested.\u003C\u002Fli\u003E\n\u003Cli\u003EWe will be humble enough to write those tests first.\u003C\u002Fli\u003E\n\u003Cli\u003EWe will practice so that we become better at our craft.\u003C\u002Fli\u003E\u003C\u002Ful\u003E\n\u003Ch3 id=\"we-will-remember-what-our-grandmothers-and-grandfathers-told-us\"\u003EWe will remember what our grandmothers and grandfathers told us:\u003Ca aria-hidden=\"true\" tabindex=\"-1\" href=\"#we-will-remember-what-our-grandmothers-and-grandfathers-told-us\"\u003E\u003Cspan class=\"heading-link\"\u003E#\u003C\u002Fspan\u003E\u003C\u002Fa\u003E\u003C\u002Fh3\u003E\n\u003Cul\u003E\u003Cli\u003EAnything worth doing is worth doing well.\u003C\u002Fli\u003E\n\u003Cli\u003ESlow and steady wins the race.\u003C\u002Fli\u003E\n\u003Cli\u003EMeasure twice cut once.\u003C\u002Fli\u003E\n\u003Cli\u003EPractice, Practice, Practice.\u003C\u002Fli\u003E\u003C\u002Ful\u003E\n\u003Cp\u003EI suppose that some people might look askance at our code katas and our code retreats, and our practice sessions.\nThey might think that we’re turning inwards and abandoning our customers. They might think that we’ve given up on the\nreal world and have yielded to the temptation to entertain ourselves. I can see how someone might come to that conclusion.\u003C\u002Fp\u003E\n\u003Cp\u003EBut they are as wrong as the day is long. We are doing this because we care about the customer. We are dedicating time\nand effort to being the best that we can be so that our employers will get the best possible value out of us.\u003C\u002Fp\u003E\n\u003Cblockquote\u003E\u003Cp\u003EDo you think the only time musicians play their instruments is when they are on stage? Do you think the only time that batters hit balls is during games? Do you think the only time lawyers give a closing is at trial? Of course not. These people are professionals; and professionals practice! Professionals study the minutia of their disciplines. Professionals know all the little tricks and quirks. They know the history, the theories, the anecdotes. They know techniques and methods. They know good options and bad options and how to tell them apart. And they know all this stuff because they practice, practice practice.\u003C\u002Fp\u003E\u003C\u002Fblockquote\u003E\n\u003Cp\u003ESo when you see someone wearing a green wrist-band that says “Clean Code” or “Test First” or “Test Obsessed”, it’s not\nbecause they’ve joined a movement, or signed a manifesto, or that they somehow feel superior to everyone else.\nThey aren’t participants in a holy war. They aren’t trying to join a tribe and huddle around a campfire.\nThe green band is a personal thing. It’s a promise made to one’s self: \u003C\u002Fp\u003E\n\u003Cblockquote\u003E\u003Cp\u003E“I will do a good job. I will not rush. I will write tests. I will go fast by going well. I will not write crap. And I will practice, practice practice so that I can be a professional.”\u003C\u002Fp\u003E\u003C\u002Fblockquote\u003E\n\u003Cp\u003EThanks for reading!\u003C\u002Fp\u003E",{"code":11,"map":12},"",null,"4 min read",[15,30],{"slug":16,"title":17,"date":18,"excerpt":19,"tags":20,"html":28,"css":29,"head":11,"readingTime":13},"open-source-x-free-software","Open Source x Free Software: What's the difference?","2022-12-23T00:00:00.000Z","Learn the difference between these two terms that often get mixed up.",[21,22,23,24,25,26,27],"Free Software","Open Source","Concepts","FOSS","FLOSS","Libre Software","Freedom","\u003Cp\u003EFree software is a concept that’s been around for a long time, and so is open source. At first glance, they may seem like the same thing with different names. However, they are very different in their philosophy. In this article, I’ll explain what each one is and how they are different.\u003C\u002Fp\u003E\n\u003Ch2 id=\"free-software\"\u003EFree Software\u003Ca aria-hidden=\"true\" tabindex=\"-1\" href=\"#free-software\"\u003E\u003Cspan class=\"heading-link\"\u003E#\u003C\u002Fspan\u003E\u003C\u002Fa\u003E\u003C\u002Fh2\u003E\n\u003Cp\u003EAccording to the \u003Ca href=\"https:\u002F\u002Fwww.fsf.org\u002F\" rel=\"nofollow noopener noreferrer\" target=\"_blank\"\u003EFree Software Foundation (FSF)\u003C\u002Fa\u003E, free software is the software that respects the user’s freedom and sense of community. This means that the user has the freedom to run, copy, distribute, study, change and improve it.\u003C\u002Fp\u003E\n\u003Cp\u003EA common phrase you may read somewhere is “Free as in freedom, not as in beer”. This means that the name doesn’t indicate that the software is free of charge, only that the user has the freedom to do whatever they want with it.\u003C\u002Fp\u003E\n\u003Cp\u003EThe FSF lists four essential freedoms that every free software must follow:\u003C\u002Fp\u003E\n\u003Cul\u003E\u003Cli\u003EThe freedom to run the program as you wish, for any purpose (freedom 0);\u003C\u002Fli\u003E\n\u003Cli\u003EThe freedom to study how the program works, and change it so it does your computing as you wish (freedom 1). Access to the source code is a precondition for this;\u003C\u002Fli\u003E\n\u003Cli\u003EThe freedom to redistribute copies so you can help others (freedom 2);\u003C\u002Fli\u003E\n\u003Cli\u003EThe freedom to distribute copies of your modified versions to others (freedom 3). By doing this you can give the whole community a chance to benefit from your changes. Access to the source code is a precondition for this.\u003C\u002Fli\u003E\u003C\u002Ful\u003E\n\u003Cp\u003EYou can read more about Free Software at gnu.org, \u003Ca href=\"https:\u002F\u002Fwww.gnu.org\u002Fphilosophy\u002Ffree-sw.en.html\" rel=\"nofollow noopener noreferrer\" target=\"_blank\"\u003Ehere\u003C\u002Fa\u003E.\u003C\u002Fp\u003E\n\u003Ch2 id=\"open-source\"\u003EOpen Source\u003Ca aria-hidden=\"true\" tabindex=\"-1\" href=\"#open-source\"\u003E\u003Cspan class=\"heading-link\"\u003E#\u003C\u002Fspan\u003E\u003C\u002Fa\u003E\u003C\u002Fh2\u003E\n\u003Cp\u003EThe \u003Ca href=\"https:\u002F\u002Fopensource.org\u002F\" rel=\"nofollow noopener noreferrer\" target=\"_blank\"\u003EOpen Source Initiative\u003C\u002Fa\u003E defines 10 criteria for software to be considered open source. You can read them fully \u003Ca href=\"https:\u002F\u002Fopensource.org\u002Fdocs\u002Fdefinition.php\" rel=\"nofollow noopener noreferrer\" target=\"_blank\"\u003Ehere\u003C\u002Fa\u003E. I’ll summarize them below:\u003C\u002Fp\u003E\n\u003Cul\u003E\u003Cli\u003EAny person must be able to distribute or sell the software without restrictions;\u003C\u002Fli\u003E\n\u003Cli\u003EThe source code must be distributed along with the software, or at least link to it clearly;\u003C\u002Fli\u003E\n\u003Cli\u003EA copy of the license must be distributed with the software;\u003C\u002Fli\u003E\n\u003Cli\u003EPeople must be able to modify your software and redistribute it with the same license;\u003C\u002Fli\u003E\n\u003Cli\u003EModifications must only be redistributed with a different name or version than the original code;\u003C\u002Fli\u003E\u003C\u002Ful\u003E\n\u003Ch2 id=\"the-difference\"\u003EThe Difference\u003Ca aria-hidden=\"true\" tabindex=\"-1\" href=\"#the-difference\"\u003E\u003Cspan class=\"heading-link\"\u003E#\u003C\u002Fspan\u003E\u003C\u002Fa\u003E\u003C\u002Fh2\u003E\n\u003Cp\u003EBy reading each concept’s principles above, you can get the idea that Open Source is a more neutral concept when compared to Free Software. It does not deal with the user’s freedom, only with the technical aspects of the software. Richard Stallman, the founder on FSF, summarized really well the differences between the two concepts:\u003C\u002Fp\u003E\n\u003Cblockquote\u003E\u003Cp\u003EThe terms “free software” and “open source” stand for almost the same range of programs. However, they say deeply different things about those programs, based on different values. The free software movement campaigns for freedom for the users of computing; it is a movement for freedom and justice. By contrast, the open source idea values mainly practical advantage and does not campaign for principles. - Richard Stallman\u003C\u002Fp\u003E\u003C\u002Fblockquote\u003E\n\u003Cp\u003EYou can read more about it \u003Ca href=\"https:\u002F\u002Fwww.gnu.org\u002Fphilosophy\u002Fopen-source-misses-the-point.en.html\" rel=\"nofollow noopener noreferrer\" target=\"_blank\"\u003Ehere\u003C\u002Fa\u003E.\u003C\u002Fp\u003E\n\u003Ch2 id=\"tldr\"\u003ETL;DR\u003Ca aria-hidden=\"true\" tabindex=\"-1\" href=\"#tldr\"\u003E\u003Cspan class=\"heading-link\"\u003E#\u003C\u002Fspan\u003E\u003C\u002Fa\u003E\u003C\u002Fh2\u003E\n\u003Cp\u003EOpen Source is a technical, practical concept. Free Software is a philosophical, broader concept. Since Free Software already considers the technical aspects of Open Source, we can say that \u003Cstrong\u003EEvery Free Software is Open Source, but not every Open Source is Free Software\u003C\u002Fstrong\u003E.\u003C\u002Fp\u003E\n\u003Ch3 id=\"how-to-know-if-an-open-source-software-is-free-software\"\u003EHow to know if an Open Source software is Free Software?\u003Ca aria-hidden=\"true\" tabindex=\"-1\" href=\"#how-to-know-if-an-open-source-software-is-free-software\"\u003E\u003Cspan class=\"heading-link\"\u003E#\u003C\u002Fspan\u003E\u003C\u002Fa\u003E\u003C\u002Fh3\u003E\n\u003Cp\u003EThe easiest way is to check their license. \u003Ca href=\"https:\u002F\u002Fwww.gnu.org\u002Flicenses\u002Flicense-list.html#SoftwareLicenses\" rel=\"nofollow noopener noreferrer\" target=\"_blank\"\u003EThe FSF lists all Free Software licenses here\u003C\u002Fa\u003E, but usually most of them are under the GPL or MIT licenses.\u003C\u002Fp\u003E\n\u003Cp\u003EThanks for reading!\u003C\u002Fp\u003E",{"code":11,"map":12},{"slug":31,"title":32,"date":33,"excerpt":34,"tags":35,"html":37,"css":38,"head":11,"readingTime":39},"purpose-of-this-blog","The purpose of this blog","2022-12-18T00:00:00.000Z","Why does it exist?",[36],"Meta","\u003Cp\u003EThere are many developer blogs out there, probably because developers like to ramble about the tech they enjoy. I’m guilty of that too! This blog was created mainly for that - sharing about development stuff that I like or that I’m learning.\u003C\u002Fp\u003E\n\u003Cp\u003EThe purpose is to help myself learn about the subjects better, since there’s no better way to learn than trying to reach someone. Of course, it won’t be made of tutorials only - I intend to write about some theoretical concepts, and maybe tech stuff not related to development.\u003C\u002Fp\u003E\n\u003Cp\u003EI consider myself a tech enthusiast. Which means I like to talk about software and gadgets in a way that most other people would find me annoying. This can be a great place to be able to share this with people that may care, hopefully you!\u003C\u002Fp\u003E\n\u003Cp\u003EI hope to see you here in future posts, and I hope you enjoy reading what I have to say!\u003C\u002Fp\u003E",{"code":11,"map":12},"1 min read"],"uses":{"params":["slug"]}},null]}